{
  "header": {
    "builtby": "built with 🧞‍♂️ by"
  },
  "form": {
    "gridcolumns": "Grid Columns",
    "mingridcolumns": "range",

    "gridrows": "Grid Rows",
    "mingridrows": "range",

    "featuresize": "Feature Size",
    "featuresizeUnits": "(in gridcols)",
    "featuresizeExtra": "(between 25% and 75% of cols)",
    "featureposition": "Feature Position",
    "featurepositionUnits": "(in gridcols)",
    "minfeatureposition": "range",
    "fragmentation": "Columns Fragmentation",
    "fragmentationExtra": "Controls the way the rest of the columns (excluding the feature) are \"cut\"; the fragmentation pattern is given by THE BIT REPRESENTATION of the fragmentation value, 1 = cut and start a new column, 0 = no cut. The feature will force cuts regardless of value.",
    "minfragmentation": "range",

    "imageweightrange": "Image Weight Range",
    "imageweightrangeUnits": "(10 = full image; 0 = no image)",
    "imageweightleft": "From",
    "imageweightcenter": "on the left, to",
    "imageweightright": "on the right.",

    "metadetailsrange": "Meta-details Range",
    "metadetailsrangeUnits": "(7 = all meta-details; 0 = no meta-details)",
    "metadetailsleft": "From ",
    "metadetailscenter": "on the left, to ",
    "metadetailsright": "on the right.",

    "subfeature": "Sub Feature",
    "subfeatureExtra": "Add an extra post in the feature column, with secondary emphasis, if it's not already there.",
    "boostfeature": "Boost Feature Emphasis",
    "boostfeatureExtra": "Give the feature the maximum available meta-details and image weight.",
    "balancemdandiw": "Balance MD with IW",
    "balancemdandiwExtra": "For a given post, \"consume\" less meta-details on high image weight and vice-versa.",
    "hierarchycrossing": "Hierarchy Crossing",
    "hierarchycrossingUnits": "(between 0 = no crossing and 200)",
    "hierarchycrossingExtra": "Introduces cross columns posts. The bigger the value, the more crossing occurs. The value is \"consumed\" starting for the top left corner. The rate of \"consumption\" depends on the \"effort\" required to cross over other posts. Values over 50 have increasingly more initial \"oomph\" (momentum), and are able to cross over bigger, more important posts.",
    "flipcolsrows": "Flip Cols and Rows",
    "flipcolsrowsExtra": "Treat rows as columns, and columns as rows when calculating the layout.",

    "gridcolumngap": "Grid Column Gap",
    "gridrowgap": "Grid Row Gap",
    "codebutton": "Please may I have some code",
    "currentstateurl": "Current state URL",
    "currentstateurlExtra": "(use it to share or save this state)",
    "copyurl": "Copy URL",

    "simulationmode": "Simulation Mode",

    "project": "What does this project do?",
    "reset": "Reset",
    "units": "(in px)"
  },
  "modal": {
    "header": {
      "yourcode": "Your Grid Code",
      "what": "What is this?"
    },
    "copy": {
      "title": "Copy the code below:",
      "clipboard": "Copy to clipboard!",
      "clipboardSuccess": "Code copied!",
      "html": "Show HTML",
      "css": "Show CSS"
    },
    "button": "Done"
  },
  "grid": {
    "realcssunit": "Must use real CSS units, goofball"
  },
  "explain": {
    "paragraph1": "This is <strong>a thinking and exploration tool</strong> to help with <strong>building a layout system that is predictable, intuitive, and flexible.</strong> It is intended to be used as part of a WordPress Gutenberg block to lay out a single stream of posts (e.g. the latest posts, or posts from a certain category).",
    "paragraph2": "The primary aim is to bind together numerical clues about the design intent of the user with the visual hierarchy of the entire layout and individual posts. The user doesn't need to completely understand every parameter and he or she can play with it and explore it's limits.",
    "paragraph3": "The main parameters are the <strong>lowest level</strong> parameters available to the user. We will group and link these low-level parameters into higher order ones for an easier entry point. A \"Surprise Me!\" button is just what is needed for a fun start.",
    "paragraph4": "Bear in mind that each post's container <strong>image weight and meta-details</strong> values, coupled with the \"area\" and relative order of each post will be taken into account when choosing an appropriate internal layout for each post. So, for example, a very horizontal post with a low image weight and no meta-details, will use a markup and styling that will put a small image on the left, plus a title and small excerpt.",
    "paragraph5": "The interpretation of each post's attribute value is up to the site theme. The logic here doesn't prefer one visual style over another.",
    "paragraph6": "Oh.. please use your browser full-screen, preferably on a big display. I haven't focused on making everything responsive to a T.",
    "paragraph7": "I hope this inspires you in some way and <strong>I would love to hear back from you</strong> with details about <em>that way.</em> You can find more of my thoughts about various things of my site: <a href=\"https://thinkwritecode.com\" target=\"_blank\">thinkwritecode.com</a>",
    "end-note": "Have fun!"
  }
}
